## [terraform-github](http://peterdeme.app.spacelift.tf/stack/terraform-github/run/01G6TW2V6GWSWER2BYXV7MH3AK) plan logs

```
[01G6TSSQ6ZMVKYX85P6A4J8K2A] Planning changes with 1 custom hook...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.testparam will be created
  + resource "aws_ssm_parameter" "testparam" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "peterdeme-test-parameter"
      + tags      = {
          + "developer" = "peterdeme"
          + "env_name"  = "development"
        }
      + tags_all  = {
          + "developer" = "peterdeme"
          + "env_name"  = "development"
        }
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: spacelift.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "spacelift.plan"
[01G6TSSQ6ZMVKYX85P6A4J8K2A] Unexpected exit code when planning changes: 1
```